###################################################################

# Created by write_sdc on Fri Nov 19 19:44:40 2021

###################################################################
set sdc_version 1.7

set_units -time ns -resistance kOhm -capacitance pF -power mW -voltage V       \
-current mA
set_max_fanout 4 [current_design]
set_max_area 0
set_driving_cell -lib_cell INVX1TS [get_ports {X[15]}]
set_driving_cell -lib_cell INVX1TS [get_ports {X[14]}]
set_driving_cell -lib_cell INVX1TS [get_ports {X[13]}]
set_driving_cell -lib_cell INVX1TS [get_ports {X[12]}]
set_driving_cell -lib_cell INVX1TS [get_ports {X[11]}]
set_driving_cell -lib_cell INVX1TS [get_ports {X[10]}]
set_driving_cell -lib_cell INVX1TS [get_ports {X[9]}]
set_driving_cell -lib_cell INVX1TS [get_ports {X[8]}]
set_driving_cell -lib_cell INVX1TS [get_ports {X[7]}]
set_driving_cell -lib_cell INVX1TS [get_ports {X[6]}]
set_driving_cell -lib_cell INVX1TS [get_ports {X[5]}]
set_driving_cell -lib_cell INVX1TS [get_ports {X[4]}]
set_driving_cell -lib_cell INVX1TS [get_ports {X[3]}]
set_driving_cell -lib_cell INVX1TS [get_ports {X[2]}]
set_driving_cell -lib_cell INVX1TS [get_ports {X[1]}]
set_driving_cell -lib_cell INVX1TS [get_ports {X[0]}]
set_driving_cell -lib_cell INVX1TS [get_ports {B[15]}]
set_driving_cell -lib_cell INVX1TS [get_ports {B[14]}]
set_driving_cell -lib_cell INVX1TS [get_ports {B[13]}]
set_driving_cell -lib_cell INVX1TS [get_ports {B[12]}]
set_driving_cell -lib_cell INVX1TS [get_ports {B[11]}]
set_driving_cell -lib_cell INVX1TS [get_ports {B[10]}]
set_driving_cell -lib_cell INVX1TS [get_ports {B[9]}]
set_driving_cell -lib_cell INVX1TS [get_ports {B[8]}]
set_driving_cell -lib_cell INVX1TS [get_ports {B[7]}]
set_driving_cell -lib_cell INVX1TS [get_ports {B[6]}]
set_driving_cell -lib_cell INVX1TS [get_ports {B[5]}]
set_driving_cell -lib_cell INVX1TS [get_ports {B[4]}]
set_driving_cell -lib_cell INVX1TS [get_ports {B[3]}]
set_driving_cell -lib_cell INVX1TS [get_ports {B[2]}]
set_driving_cell -lib_cell INVX1TS [get_ports {B[1]}]
set_driving_cell -lib_cell INVX1TS [get_ports {B[0]}]
set_driving_cell -lib_cell INVX1TS [get_ports R]
set_driving_cell -lib_cell INVX1TS [get_ports clk]
set_load -pin_load 1 [get_ports {y[38]}]
set_load -pin_load 1 [get_ports {y[37]}]
set_load -pin_load 1 [get_ports {y[36]}]
set_load -pin_load 1 [get_ports {y[35]}]
set_load -pin_load 1 [get_ports {y[34]}]
set_load -pin_load 1 [get_ports {y[33]}]
set_load -pin_load 1 [get_ports {y[32]}]
set_load -pin_load 1 [get_ports {y[31]}]
set_load -pin_load 1 [get_ports {y[30]}]
set_load -pin_load 1 [get_ports {y[29]}]
set_load -pin_load 1 [get_ports {y[28]}]
set_load -pin_load 1 [get_ports {y[27]}]
set_load -pin_load 1 [get_ports {y[26]}]
set_load -pin_load 1 [get_ports {y[25]}]
set_load -pin_load 1 [get_ports {y[24]}]
set_load -pin_load 1 [get_ports {y[23]}]
set_load -pin_load 1 [get_ports {y[22]}]
set_load -pin_load 1 [get_ports {y[21]}]
set_load -pin_load 1 [get_ports {y[20]}]
set_load -pin_load 1 [get_ports {y[19]}]
set_load -pin_load 1 [get_ports {y[18]}]
set_load -pin_load 1 [get_ports {y[17]}]
set_load -pin_load 1 [get_ports {y[16]}]
set_load -pin_load 1 [get_ports {y[15]}]
set_load -pin_load 1 [get_ports {y[14]}]
set_load -pin_load 1 [get_ports {y[13]}]
set_load -pin_load 1 [get_ports {y[12]}]
set_load -pin_load 1 [get_ports {y[11]}]
set_load -pin_load 1 [get_ports {y[10]}]
set_load -pin_load 1 [get_ports {y[9]}]
set_load -pin_load 1 [get_ports {y[8]}]
set_load -pin_load 1 [get_ports {y[7]}]
set_load -pin_load 1 [get_ports {y[6]}]
set_load -pin_load 1 [get_ports {y[5]}]
set_load -pin_load 1 [get_ports {y[4]}]
set_load -pin_load 1 [get_ports {y[3]}]
set_load -pin_load 1 [get_ports {y[2]}]
set_load -pin_load 1 [get_ports {y[1]}]
set_load -pin_load 1 [get_ports {y[0]}]
set_max_capacitance 0.005 [get_ports {X[15]}]
set_max_capacitance 0.005 [get_ports {X[14]}]
set_max_capacitance 0.005 [get_ports {X[13]}]
set_max_capacitance 0.005 [get_ports {X[12]}]
set_max_capacitance 0.005 [get_ports {X[11]}]
set_max_capacitance 0.005 [get_ports {X[10]}]
set_max_capacitance 0.005 [get_ports {X[9]}]
set_max_capacitance 0.005 [get_ports {X[8]}]
set_max_capacitance 0.005 [get_ports {X[7]}]
set_max_capacitance 0.005 [get_ports {X[6]}]
set_max_capacitance 0.005 [get_ports {X[5]}]
set_max_capacitance 0.005 [get_ports {X[4]}]
set_max_capacitance 0.005 [get_ports {X[3]}]
set_max_capacitance 0.005 [get_ports {X[2]}]
set_max_capacitance 0.005 [get_ports {X[1]}]
set_max_capacitance 0.005 [get_ports {X[0]}]
set_max_capacitance 0.005 [get_ports {B[15]}]
set_max_capacitance 0.005 [get_ports {B[14]}]
set_max_capacitance 0.005 [get_ports {B[13]}]
set_max_capacitance 0.005 [get_ports {B[12]}]
set_max_capacitance 0.005 [get_ports {B[11]}]
set_max_capacitance 0.005 [get_ports {B[10]}]
set_max_capacitance 0.005 [get_ports {B[9]}]
set_max_capacitance 0.005 [get_ports {B[8]}]
set_max_capacitance 0.005 [get_ports {B[7]}]
set_max_capacitance 0.005 [get_ports {B[6]}]
set_max_capacitance 0.005 [get_ports {B[5]}]
set_max_capacitance 0.005 [get_ports {B[4]}]
set_max_capacitance 0.005 [get_ports {B[3]}]
set_max_capacitance 0.005 [get_ports {B[2]}]
set_max_capacitance 0.005 [get_ports {B[1]}]
set_max_capacitance 0.005 [get_ports {B[0]}]
set_max_capacitance 0.005 [get_ports R]
set_max_capacitance 0.005 [get_ports clk]
set_max_fanout 4 [get_ports {X[15]}]
set_max_fanout 4 [get_ports {X[14]}]
set_max_fanout 4 [get_ports {X[13]}]
set_max_fanout 4 [get_ports {X[12]}]
set_max_fanout 4 [get_ports {X[11]}]
set_max_fanout 4 [get_ports {X[10]}]
set_max_fanout 4 [get_ports {X[9]}]
set_max_fanout 4 [get_ports {X[8]}]
set_max_fanout 4 [get_ports {X[7]}]
set_max_fanout 4 [get_ports {X[6]}]
set_max_fanout 4 [get_ports {X[5]}]
set_max_fanout 4 [get_ports {X[4]}]
set_max_fanout 4 [get_ports {X[3]}]
set_max_fanout 4 [get_ports {X[2]}]
set_max_fanout 4 [get_ports {X[1]}]
set_max_fanout 4 [get_ports {X[0]}]
set_max_fanout 4 [get_ports {B[15]}]
set_max_fanout 4 [get_ports {B[14]}]
set_max_fanout 4 [get_ports {B[13]}]
set_max_fanout 4 [get_ports {B[12]}]
set_max_fanout 4 [get_ports {B[11]}]
set_max_fanout 4 [get_ports {B[10]}]
set_max_fanout 4 [get_ports {B[9]}]
set_max_fanout 4 [get_ports {B[8]}]
set_max_fanout 4 [get_ports {B[7]}]
set_max_fanout 4 [get_ports {B[6]}]
set_max_fanout 4 [get_ports {B[5]}]
set_max_fanout 4 [get_ports {B[4]}]
set_max_fanout 4 [get_ports {B[3]}]
set_max_fanout 4 [get_ports {B[2]}]
set_max_fanout 4 [get_ports {B[1]}]
set_max_fanout 4 [get_ports {B[0]}]
set_max_fanout 4 [get_ports R]
set_max_fanout 4 [get_ports clk]
set_ideal_network [get_ports clk]
create_clock [get_ports clk]  -period 10  -waveform {0 5}
set_clock_uncertainty 0  [get_clocks clk]
set_clock_transition -max -rise 0.01 [get_clocks clk]
set_clock_transition -max -fall 0.01 [get_clocks clk]
set_clock_transition -min -rise 0.01 [get_clocks clk]
set_clock_transition -min -fall 0.01 [get_clocks clk]
set_input_delay -clock clk  0.05  [get_ports {X[15]}]
set_input_delay -clock clk  0.05  [get_ports {X[14]}]
set_input_delay -clock clk  0.05  [get_ports {X[13]}]
set_input_delay -clock clk  0.05  [get_ports {X[12]}]
set_input_delay -clock clk  0.05  [get_ports {X[11]}]
set_input_delay -clock clk  0.05  [get_ports {X[10]}]
set_input_delay -clock clk  0.05  [get_ports {X[9]}]
set_input_delay -clock clk  0.05  [get_ports {X[8]}]
set_input_delay -clock clk  0.05  [get_ports {X[7]}]
set_input_delay -clock clk  0.05  [get_ports {X[6]}]
set_input_delay -clock clk  0.05  [get_ports {X[5]}]
set_input_delay -clock clk  0.05  [get_ports {X[4]}]
set_input_delay -clock clk  0.05  [get_ports {X[3]}]
set_input_delay -clock clk  0.05  [get_ports {X[2]}]
set_input_delay -clock clk  0.05  [get_ports {X[1]}]
set_input_delay -clock clk  0.05  [get_ports {X[0]}]
set_input_delay -clock clk  0.05  [get_ports {B[15]}]
set_input_delay -clock clk  0.05  [get_ports {B[14]}]
set_input_delay -clock clk  0.05  [get_ports {B[13]}]
set_input_delay -clock clk  0.05  [get_ports {B[12]}]
set_input_delay -clock clk  0.05  [get_ports {B[11]}]
set_input_delay -clock clk  0.05  [get_ports {B[10]}]
set_input_delay -clock clk  0.05  [get_ports {B[9]}]
set_input_delay -clock clk  0.05  [get_ports {B[8]}]
set_input_delay -clock clk  0.05  [get_ports {B[7]}]
set_input_delay -clock clk  0.05  [get_ports {B[6]}]
set_input_delay -clock clk  0.05  [get_ports {B[5]}]
set_input_delay -clock clk  0.05  [get_ports {B[4]}]
set_input_delay -clock clk  0.05  [get_ports {B[3]}]
set_input_delay -clock clk  0.05  [get_ports {B[2]}]
set_input_delay -clock clk  0.05  [get_ports {B[1]}]
set_input_delay -clock clk  0.05  [get_ports {B[0]}]
set_input_delay -clock clk  0.05  [get_ports R]
set_output_delay -clock clk  0.05  [get_ports {y[38]}]
set_output_delay -clock clk  0.05  [get_ports {y[37]}]
set_output_delay -clock clk  0.05  [get_ports {y[36]}]
set_output_delay -clock clk  0.05  [get_ports {y[35]}]
set_output_delay -clock clk  0.05  [get_ports {y[34]}]
set_output_delay -clock clk  0.05  [get_ports {y[33]}]
set_output_delay -clock clk  0.05  [get_ports {y[32]}]
set_output_delay -clock clk  0.05  [get_ports {y[31]}]
set_output_delay -clock clk  0.05  [get_ports {y[30]}]
set_output_delay -clock clk  0.05  [get_ports {y[29]}]
set_output_delay -clock clk  0.05  [get_ports {y[28]}]
set_output_delay -clock clk  0.05  [get_ports {y[27]}]
set_output_delay -clock clk  0.05  [get_ports {y[26]}]
set_output_delay -clock clk  0.05  [get_ports {y[25]}]
set_output_delay -clock clk  0.05  [get_ports {y[24]}]
set_output_delay -clock clk  0.05  [get_ports {y[23]}]
set_output_delay -clock clk  0.05  [get_ports {y[22]}]
set_output_delay -clock clk  0.05  [get_ports {y[21]}]
set_output_delay -clock clk  0.05  [get_ports {y[20]}]
set_output_delay -clock clk  0.05  [get_ports {y[19]}]
set_output_delay -clock clk  0.05  [get_ports {y[18]}]
set_output_delay -clock clk  0.05  [get_ports {y[17]}]
set_output_delay -clock clk  0.05  [get_ports {y[16]}]
set_output_delay -clock clk  0.05  [get_ports {y[15]}]
set_output_delay -clock clk  0.05  [get_ports {y[14]}]
set_output_delay -clock clk  0.05  [get_ports {y[13]}]
set_output_delay -clock clk  0.05  [get_ports {y[12]}]
set_output_delay -clock clk  0.05  [get_ports {y[11]}]
set_output_delay -clock clk  0.05  [get_ports {y[10]}]
set_output_delay -clock clk  0.05  [get_ports {y[9]}]
set_output_delay -clock clk  0.05  [get_ports {y[8]}]
set_output_delay -clock clk  0.05  [get_ports {y[7]}]
set_output_delay -clock clk  0.05  [get_ports {y[6]}]
set_output_delay -clock clk  0.05  [get_ports {y[5]}]
set_output_delay -clock clk  0.05  [get_ports {y[4]}]
set_output_delay -clock clk  0.05  [get_ports {y[3]}]
set_output_delay -clock clk  0.05  [get_ports {y[2]}]
set_output_delay -clock clk  0.05  [get_ports {y[1]}]
set_output_delay -clock clk  0.05  [get_ports {y[0]}]
