###################################################################

# Created by write_sdc on Fri Nov 19 16:47:33 2021

###################################################################
set sdc_version 1.7

set_units -time ns -resistance kOhm -capacitance pF -power mW -voltage V       \
-current mA
set_max_fanout 4 [current_design]
set_max_area 0
set_driving_cell -lib_cell INVX1TS [get_ports {Addr[5]}]
set_driving_cell -lib_cell INVX1TS [get_ports {Addr[4]}]
set_driving_cell -lib_cell INVX1TS [get_ports {Addr[3]}]
set_driving_cell -lib_cell INVX1TS [get_ports {Addr[2]}]
set_driving_cell -lib_cell INVX1TS [get_ports {Addr[1]}]
set_driving_cell -lib_cell INVX1TS [get_ports {Addr[0]}]
set_driving_cell -lib_cell INVX1TS [get_ports R]
set_driving_cell -lib_cell INVX1TS [get_ports E]
set_driving_cell -lib_cell INVX1TS [get_ports {w[15]}]
set_driving_cell -lib_cell INVX1TS [get_ports {w[14]}]
set_driving_cell -lib_cell INVX1TS [get_ports {w[13]}]
set_driving_cell -lib_cell INVX1TS [get_ports {w[12]}]
set_driving_cell -lib_cell INVX1TS [get_ports {w[11]}]
set_driving_cell -lib_cell INVX1TS [get_ports {w[10]}]
set_driving_cell -lib_cell INVX1TS [get_ports {w[9]}]
set_driving_cell -lib_cell INVX1TS [get_ports {w[8]}]
set_driving_cell -lib_cell INVX1TS [get_ports {w[7]}]
set_driving_cell -lib_cell INVX1TS [get_ports {w[6]}]
set_driving_cell -lib_cell INVX1TS [get_ports {w[5]}]
set_driving_cell -lib_cell INVX1TS [get_ports {w[4]}]
set_driving_cell -lib_cell INVX1TS [get_ports {w[3]}]
set_driving_cell -lib_cell INVX1TS [get_ports {w[2]}]
set_driving_cell -lib_cell INVX1TS [get_ports {w[1]}]
set_driving_cell -lib_cell INVX1TS [get_ports {w[0]}]
set_driving_cell -lib_cell INVX1TS [get_ports clk]
set_load -pin_load 1 [get_ports {Q[15]}]
set_load -pin_load 1 [get_ports {Q[14]}]
set_load -pin_load 1 [get_ports {Q[13]}]
set_load -pin_load 1 [get_ports {Q[12]}]
set_load -pin_load 1 [get_ports {Q[11]}]
set_load -pin_load 1 [get_ports {Q[10]}]
set_load -pin_load 1 [get_ports {Q[9]}]
set_load -pin_load 1 [get_ports {Q[8]}]
set_load -pin_load 1 [get_ports {Q[7]}]
set_load -pin_load 1 [get_ports {Q[6]}]
set_load -pin_load 1 [get_ports {Q[5]}]
set_load -pin_load 1 [get_ports {Q[4]}]
set_load -pin_load 1 [get_ports {Q[3]}]
set_load -pin_load 1 [get_ports {Q[2]}]
set_load -pin_load 1 [get_ports {Q[1]}]
set_load -pin_load 1 [get_ports {Q[0]}]
set_max_capacitance 0.005 [get_ports {Addr[5]}]
set_max_capacitance 0.005 [get_ports {Addr[4]}]
set_max_capacitance 0.005 [get_ports {Addr[3]}]
set_max_capacitance 0.005 [get_ports {Addr[2]}]
set_max_capacitance 0.005 [get_ports {Addr[1]}]
set_max_capacitance 0.005 [get_ports {Addr[0]}]
set_max_capacitance 0.005 [get_ports R]
set_max_capacitance 0.005 [get_ports E]
set_max_capacitance 0.005 [get_ports {w[15]}]
set_max_capacitance 0.005 [get_ports {w[14]}]
set_max_capacitance 0.005 [get_ports {w[13]}]
set_max_capacitance 0.005 [get_ports {w[12]}]
set_max_capacitance 0.005 [get_ports {w[11]}]
set_max_capacitance 0.005 [get_ports {w[10]}]
set_max_capacitance 0.005 [get_ports {w[9]}]
set_max_capacitance 0.005 [get_ports {w[8]}]
set_max_capacitance 0.005 [get_ports {w[7]}]
set_max_capacitance 0.005 [get_ports {w[6]}]
set_max_capacitance 0.005 [get_ports {w[5]}]
set_max_capacitance 0.005 [get_ports {w[4]}]
set_max_capacitance 0.005 [get_ports {w[3]}]
set_max_capacitance 0.005 [get_ports {w[2]}]
set_max_capacitance 0.005 [get_ports {w[1]}]
set_max_capacitance 0.005 [get_ports {w[0]}]
set_max_capacitance 0.005 [get_ports clk]
set_max_fanout 4 [get_ports {Addr[5]}]
set_max_fanout 4 [get_ports {Addr[4]}]
set_max_fanout 4 [get_ports {Addr[3]}]
set_max_fanout 4 [get_ports {Addr[2]}]
set_max_fanout 4 [get_ports {Addr[1]}]
set_max_fanout 4 [get_ports {Addr[0]}]
set_max_fanout 4 [get_ports R]
set_max_fanout 4 [get_ports E]
set_max_fanout 4 [get_ports {w[15]}]
set_max_fanout 4 [get_ports {w[14]}]
set_max_fanout 4 [get_ports {w[13]}]
set_max_fanout 4 [get_ports {w[12]}]
set_max_fanout 4 [get_ports {w[11]}]
set_max_fanout 4 [get_ports {w[10]}]
set_max_fanout 4 [get_ports {w[9]}]
set_max_fanout 4 [get_ports {w[8]}]
set_max_fanout 4 [get_ports {w[7]}]
set_max_fanout 4 [get_ports {w[6]}]
set_max_fanout 4 [get_ports {w[5]}]
set_max_fanout 4 [get_ports {w[4]}]
set_max_fanout 4 [get_ports {w[3]}]
set_max_fanout 4 [get_ports {w[2]}]
set_max_fanout 4 [get_ports {w[1]}]
set_max_fanout 4 [get_ports {w[0]}]
set_max_fanout 4 [get_ports clk]
set_ideal_network [get_ports clk]
create_clock [get_ports clk]  -period 20  -waveform {0 10}
set_clock_uncertainty 0  [get_clocks clk]
set_clock_transition -max -rise 0.01 [get_clocks clk]
set_clock_transition -max -fall 0.01 [get_clocks clk]
set_clock_transition -min -rise 0.01 [get_clocks clk]
set_clock_transition -min -fall 0.01 [get_clocks clk]
set_input_delay -clock clk  0.05  [get_ports {Addr[5]}]
set_input_delay -clock clk  0.05  [get_ports {Addr[4]}]
set_input_delay -clock clk  0.05  [get_ports {Addr[3]}]
set_input_delay -clock clk  0.05  [get_ports {Addr[2]}]
set_input_delay -clock clk  0.05  [get_ports {Addr[1]}]
set_input_delay -clock clk  0.05  [get_ports {Addr[0]}]
set_input_delay -clock clk  0.05  [get_ports R]
set_input_delay -clock clk  0.05  [get_ports E]
set_input_delay -clock clk  0.05  [get_ports {w[15]}]
set_input_delay -clock clk  0.05  [get_ports {w[14]}]
set_input_delay -clock clk  0.05  [get_ports {w[13]}]
set_input_delay -clock clk  0.05  [get_ports {w[12]}]
set_input_delay -clock clk  0.05  [get_ports {w[11]}]
set_input_delay -clock clk  0.05  [get_ports {w[10]}]
set_input_delay -clock clk  0.05  [get_ports {w[9]}]
set_input_delay -clock clk  0.05  [get_ports {w[8]}]
set_input_delay -clock clk  0.05  [get_ports {w[7]}]
set_input_delay -clock clk  0.05  [get_ports {w[6]}]
set_input_delay -clock clk  0.05  [get_ports {w[5]}]
set_input_delay -clock clk  0.05  [get_ports {w[4]}]
set_input_delay -clock clk  0.05  [get_ports {w[3]}]
set_input_delay -clock clk  0.05  [get_ports {w[2]}]
set_input_delay -clock clk  0.05  [get_ports {w[1]}]
set_input_delay -clock clk  0.05  [get_ports {w[0]}]
set_output_delay -clock clk  0.05  [get_ports {Q[15]}]
set_output_delay -clock clk  0.05  [get_ports {Q[14]}]
set_output_delay -clock clk  0.05  [get_ports {Q[13]}]
set_output_delay -clock clk  0.05  [get_ports {Q[12]}]
set_output_delay -clock clk  0.05  [get_ports {Q[11]}]
set_output_delay -clock clk  0.05  [get_ports {Q[10]}]
set_output_delay -clock clk  0.05  [get_ports {Q[9]}]
set_output_delay -clock clk  0.05  [get_ports {Q[8]}]
set_output_delay -clock clk  0.05  [get_ports {Q[7]}]
set_output_delay -clock clk  0.05  [get_ports {Q[6]}]
set_output_delay -clock clk  0.05  [get_ports {Q[5]}]
set_output_delay -clock clk  0.05  [get_ports {Q[4]}]
set_output_delay -clock clk  0.05  [get_ports {Q[3]}]
set_output_delay -clock clk  0.05  [get_ports {Q[2]}]
set_output_delay -clock clk  0.05  [get_ports {Q[1]}]
set_output_delay -clock clk  0.05  [get_ports {Q[0]}]
